# File di pulizia dei dati

Abbiamo utilizzato questo file per separare la pulizia della struttura dei dati dalla analisi diretta delle informazioni

In [20]:
import pandas as pd 
df_actors=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\actors.csv")
df_countries=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\countries.csv")
df_crew=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\crew.csv")
df_genres=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\genres.csv")
df_languages=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\languages.csv")
df_movies=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\movies.csv")
df_posters=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\posters.csv")
df_releases=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\releases.csv")
df_studios=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\studios.csv")
df_themes=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\themes.csv")
df_tomatoes=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\aggiuntivi\\rotten_tomatoes_reviews.csv")
df_oscars=pd.read_csv("C:\\Users\\andre\\Desktop\\Dati_Tweb\\aggiuntivi\\the_oscar_awards.csv")

# Analisi di ogni file per la pulizia dei dati

## Analisi actors.csv

In [21]:
df_actors.shape

(5798450, 3)

In [46]:

df_actors.rename(columns={'id': 'id_film'}, inplace=True)
df_actors['name']=df_actors['name'].astype("str")
df_actors.dtypes

id_Film     int64
name       object
role       object
dtype: object

In [47]:
df_actors.head()

   id_Film               name    role
0  1000001      Margot Robbie  Barbie
1  1000001       Ryan Gosling     Ken
2  1000001    America Ferrera  Gloria
3  1000001  Ariana Greenblatt   Sasha
4  1000001           Issa Rae  Barbie

Possiamo notare come non ci siano valori nulli all'interno del dataset come nomi, mentre sono presenti più valori nulli all'interno dei ruoli che quindi valuteremo come "Extra" e riassegneremo il valore

In [49]:
#(df_actors["role"]=="Extra").sum()
df_actors.fillna({"role":"Extra"},inplace=True)
#print(type(df_actors['role'][0]))

#df_actors.query('name=="Nan"')
#df_actors.query('role=="Nan"')
#print(type(df_actors.loc[80182]['role']))
 #df_actors.query('role=="Nan"')

Controllo dei valori duplicati

In [50]:
#sono presenti duplicati
df_actors.duplicated().sum()

np.int64(946)

In [55]:
#visualizzazioni dei duplicati in ogni colonna  
#df_actors.loc[df_actors.duplicated(subset=["id_Film","name","role"])]

#rimozione dei duplicati
df_actors.drop_duplicates(inplace=True)

df_actors.reset_index(drop=True,inplace=True)

print(df_actors.tail())

         id_Film            name                 role
5797499  1941596         Marc Ma            Ba Cai/巴莱
5797500  1941596             线雨轩              Tata/塔塔
5797501  1941596    Jiang Yixuan  Zuo Yila（Zoila）/佐伊拉
5797502  1941597  Hiroshi Mikami                Extra
5797503  1941597   Keiko Oginome                Extra

In [56]:
#Per conoscere la situazione finale 
df_actors.shape

(5797504, 3)

## Analisi countries.csv

In [ ]:
df_countries.shape

print(df_countries.head())

df_countries

        id      country
0  1000001           UK
1  1000001          USA
2  1000002  South Korea
3  1000003          USA
4  1000004      Germany

In [11]:
df_countries.dtypes

id          int64
country    object
dtype: object

In [63]:
#df_actors['name']=df_actors['name'].astype("str")
df_countries.rename(columns={'id': 'id_film'}, inplace=True)

df_countries.dtypes

id_film     int64
country    object
dtype: object

In [64]:
#Non sono presenti valori NaN
df_countries.isna().sum()

id_film    0
country    0
dtype: int64

In [65]:
#Non sono presenti duplicati
df_countries.duplicated().sum()

np.int64(0)

## Analisi crew.csv

In [14]:
df_crew.shape

(4720183, 3)

In [82]:
df_crew.dtypes
df_crew.rename(columns={'id': 'id_film'}, inplace=True)


#df_actors['name']=df_actors['name'].astype("str")
#print(type(df_crew['role'][0]))

id_film     int64
role       object
name       object
dtype: object

In [79]:
#Viene trovato un valore null come nome
Row_nun=df_crew.loc[df_crew['name'].isna()]
#Row_nun=df_crew.loc[df_crew['name']=="Unknown"]
print(Row_nun)

              id    role name
4562126  1859397  Writer  NaN

In [80]:
df_movies.loc[df_movies["id"]==1859397]
#df_crew.loc[df_crew["id"]==1859397]

#scegliere se rimuoverlo o no 
#df_crew.dropna(inplace=True) \
  #  .reset_index(drop=True)

,id,name,date,tagline,description,minute,rating
859396,1859397,Naniwa Danshi LIVE TOUR 2023 'POPMALL',2024.0,NaN,Naniwa Danshi LIVE TOUR 2023 'POPMALL' is a li...,146.0,NaN

## Analisi di genres.csv

In [18]:
df_genres.shape

(1046849, 2)

In [ ]:
df_genres.rename(columns={'id': 'id_film'}, inplace=True)

df_genres.dtypes

print(type(df_genres['genre'][0]))

df_genres

<class 'str'>

In [88]:
df_genres.isna().sum()

#print(df_genres["genre"].unique())

id_film    0
genre      0
dtype: int64

In [89]:
df_genres.duplicated().sum()

np.int64(0)

## Analisi di languages.csv

In [22]:
df_languages.shape

(1038762, 3)

In [95]:


df_languages.rename(columns={'id': 'id_film'}, inplace=True)

df_languages.dtypes

#print(type(df_languages['type'][0]))

id           int64
type        object
language    object
dtype: object

In [111]:
df_languages.isna().sum()
#df_languages["language"].replace({"\xa0":" "},inplace=True)
df_languages["language"] = df_languages["language"].replace('Persian\xa0(Farsi)', 'Persian (Farsi)')
df_languages["language"] = df_languages["language"].replace('Hebrew\xa0(modern)', 'Hebrew (modern)')
df_languages["language"] = df_languages["language"].replace('Greek\xa0(modern)', 'Greek (modern)')
df_languages["language"] = df_languages["language"].replace('Tonga\xa0(Tonga Islands)', 'Tonga (Tonga Islands)')
df_languages["language"] = df_languages["language"].replace('Old Church Slavonic,\xa0Church Slavonic,\xa0Old Bulgarian', 'Old Church Slavonic, Church Slavonic, Old Bulgarian')

df_languages["language"].unique()

array(['English', 'Korean', 'German', 'Cantonese', 'Chinese', 'Dutch',
       'Spanish', 'French', 'Japanese', 'Swedish', 'Swahili',
       'Portuguese', 'Hindi', 'Italian', 'Tagalog', 'Xhosa', 'Latin',
       'Russian', 'Finnish', 'Hungarian', 'Somali', 'Romanian',
       'Vietnamese', 'Turkish', 'Czech', 'Estonian', 'Persian (Farsi)',
       'Urdu', 'Arabic', 'Polish', 'Hebrew (modern)', 'Greek (modern)',
       'Yiddish', 'Norwegian', 'Haitian, Haitian Creole', 'Khmer',
       'Nepali', 'Akan', 'Icelandic', 'Malay',
       'Eastern Punjabi, Eastern Panjabi', 'Georgian', 'Indonesian',
       'Belarusian', 'Danish', 'Tamil', 'Sinhalese, Sinhala',
       'Tibetan Standard, Tibetan, Central', 'Armenian', 'Thai', 'Telugu',
       'Scottish Gaelic, Gaelic', 'Northern Sami', 'Esperanto',
       'Bulgarian', 'Afrikaans', 'Chichewa, Chewa, Nyanja',
       'Southern Sotho', 'Zulu', 'Irish', 'Breton', 'Croatian',
       'Bengali, Bangla', 'Welsh', 'Navajo, Navaho', 'Albanian',
       'Inuktitut', 'Catalan', 'Quechua', 'Azerbaijani', 'Samoan',
       'Ukrainian', 'Mongolian', 'Māori', 'Tatar', 'Mayan',
       'Fula, Fulah, Pulaar, Pular', 'Slovak', 'Lithuanian', 'Cree',
       'Lao', 'Galician', 'Amharic', 'Serbian', 'Moldavian',
       'Serbo-Croatian', 'Cornish', 'Wolof', 'Pashto, Pushto', 'Twi',
       'Corsican', 'Bambara', 'Sanskrit (Saṁskṛta)', 'Macedonian',
       'Burmese', 'Maltese', 'Bosnian', 'No spoken language', 'Marathi',
       'Ido', 'Guaraní', 'Kurdish', 'Ganda', 'Hausa', 'Tahitian',
       'Latvian', 'Lingala', 'Gujarati', 'Malayalam', 'Basque',
       'Javanese', 'Tswana', 'Sundanese', 'Kinyarwanda', 'Kirundi',
       'Afar', 'Dzongkha', 'Tola', 'Kannada', 'Uzbek', 'Ojibwe, Ojibwa',
       'Igbo', 'Ewe', 'Pāli', 'Chechen', 'Kashmiri', 'Oromo',
       'Kalaallisut, Greenlandic', 'Tajik', 'Slovene', 'Aymara',
       'Sardinian', 'Assamese', 'Ossetian, Ossetic', 'Occitan', 'Avaric',
       'Bislama', 'Kyrgyz', 'Kazakh', 'Aragonese', 'Yolngu matha',
       'Malagasy', 'Gibberish', 'Kikuyu, Gikuyu', 'Yoruba', 'Maithili',
       'Uyghur', 'Sango', 'Nuosu', 'Hiri Motu', 'Kongo',
       'Tonga (Tonga Islands)', 'Shona', 'Luxembourgish, Letzeburgesch',
       'Sindhi', 'Chuvash', 'Fijian', 'Mari', 'Walloon', 'Abkhaz',
       'Inupiaq', 'Turkmen', 'Faroese', 'Marshallese', 'Romansh',
       'Western Frisian', 'Norwegian Bokmål', 'Oriya',
       'Old Church Slavonic, Church Slavonic, Old Bulgarian', 'Herero',
       'Southern Ndebele', 'Tigrinya', 'Ndonga',
       'Limburgish, Limburgan, Limburger', 'Swati', 'Norwegian Nynorsk',
       'Bashkir', 'Interlingue', 'Manx', 'Nauruan',
       'Divehi, Dhivehi, Maldivian', 'Venda', 'Interlingua',
       'Northern Ndebele', 'Chamorro', 'Zhuang, Chuang', 'Luba-Katanga',
       'Kwanyama, Kuanyama', 'Tsonga', 'Komi', 'Avestan', 'Volapük'],
      dtype=object)

In [25]:
df_languages.duplicated().sum()

np.int64(0)

## Analisi di movies.csv

In [26]:
df_movies.shape

(941597, 7)

In [27]:
df_movies.dtypes

id               int64
name            object
date           float64
tagline         object
description     object
minute         float64
rating         float64
dtype: object

In [28]:
df_movies.head(200)

,id,name,date,tagline,description,minute,rating
0,1000001,Barbie,2023.0,She's everything. He's just Ken.,Barbie and Ken are having the time of their li...,114.0,3.86
1,1000002,Parasite,2019.0,Act like you own the place.,"All unemployed, Ki-taek's family takes peculia...",133.0,4.56
2,1000003,Everything Everywhere All at Once,2022.0,The universe is so much bigger than you realize.,An aging Chinese immigrant is swept up in an i...,140.0,4.30
3,1000004,Fight Club,1999.0,Mischief. Mayhem. Soap.,A ticking-time-bomb insomniac and a slippery s...,139.0,4.27
4,1000005,La La Land,2016.0,Here's to the fools who dream.,"Mia, an aspiring actress, serves lattes to mov...",129.0,4.09
...,...,...,...,...,...,...,...
195,1000196,Tangled,2010.0,They're taking adventure to new lengths.,When the kingdom's most wanted-and most charmi...,100.0,3.93
196,1000197,Thor: Love and Thunder,2022.0,The one is not the only.,After his retirement is interrupted by Gorr th...,119.0,2.48
197,1000198,Jaws,1975.0,Don't go in the water,When an insatiable great white shark terrorize...,124.0,3.96
198,1000199,The Departed,2006.0,Lies. Betrayal. Sacrifice. How far will you ta...,"To take down South Boston's Irish Mafia, the p...",151.0,4.31
199,1000200,Avengers: Age of Ultron,2015.0,A New Age Has Come.,When Tony Stark tries to jumpstart a dormant p...,141.0,3.10

In [29]:
#df_movies["date"].rename("release_date")
#df_movies.to_datetime(df_movies["release_date"])

In [30]:
df_movies.isna().sum()

id                  0
name               10
date            91913
tagline        802210
description    160812
minute         181570
rating         850598
dtype: int64

In [36]:
df_test=df_movies.loc[df_movies["name"].isna()]
df_test

,id,name,date,tagline,description,minute,rating
287514,1287515,NaN,2015.0,NaN,NONE is a short film that explores the balance...,4.0,NaN
617642,1617643,NaN,NaN,NaN,NaN,NaN,NaN
646520,1646521,NaN,2008.0,NaN,NaN,NaN,NaN
648185,1648186,NaN,NaN,NaN,NaN,NaN,NaN
720294,1720295,NaN,NaN,NaN,"In this directorial debut of Eden Ewardson, he...",8.0,NaN
725369,1725370,NaN,NaN,NaN,NaN,NaN,NaN
741481,1741482,NaN,NaN,NaN,NaN,90.0,NaN
840337,1840338,NaN,NaN,NaN,NaN,NaN,NaN
883228,1883229,NaN,NaN,NaN,NaN,NaN,NaN
894771,1894772,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
df_movies.loc[df_movies["name"].isna() & df_movies["description"].notna()]

,id,name,date,tagline,description,minute,rating
287514,1287515,NaN,2015.0,NaN,NONE is a short film that explores the balance...,4.0,NaN
720294,1720295,NaN,NaN,NaN,"In this directorial debut of Eden Ewardson, he...",8.0,NaN

Pulizia dei valori nulli che non si collegano ad alcun film

In [ ]:
# Rimuovere i film che non hanno valori nel campo "name" e neanche nel campo "description"
# perchè è presente un film dal "name" NaN che quindi immagino sia un effettivo film
#df_movies_cleaned = df_movies.dropna(subset=['name', 'description'], how='all').reset_index(drop=True)

In [37]:
#assenza di duplicati 
df_movies.duplicated().sum()

np.int64(0)

In [ ]:

# Visualizza il numero di film rimanenti
#print(df_movies_cleaned.shape)

## Analisi di df_poster

In [38]:
df_posters.shape

(941597, 2)

In [39]:
df_posters.dtypes

id       int64
link    object
dtype: object

In [40]:
df_posters.head(100)

         id                                               link
0   1000001  https://a.ltrbxd.com/resized/film-poster/2/7/7...
1   1000002  https://a.ltrbxd.com/resized/film-poster/4/2/6...
2   1000003  https://a.ltrbxd.com/resized/film-poster/4/7/4...
3   1000004  https://a.ltrbxd.com/resized/film-poster/5/1/5...
4   1000005  https://a.ltrbxd.com/resized/film-poster/2/4/0...
..      ...                                                ...
95  1000096  https://a.ltrbxd.com/resized/film-poster/2/2/0...
96  1000097  https://a.ltrbxd.com/resized/sm/upload/a3/0q/k...
97  1000098  https://a.ltrbxd.com/resized/film-poster/4/5/9...
98  1000099  https://a.ltrbxd.com/resized/film-poster/8/6/8...
99  1000100  https://a.ltrbxd.com/resized/film-poster/2/0/9...

[100 rows x 2 columns]

In [41]:
df_posters.isna().sum()

id           0
link    180712
dtype: int64

In [ ]:
#Prendo solo i film che non contengono l'url
df_posters.loc[df_posters["link"].isna()]

#Rimuovo i film che non contengono l'url
#df_posters.dropna(subset=["link"],inplace=True)

             id link
14018   1014019  NaN
15380   1015381  NaN
16467   1016468  NaN
18452   1018453  NaN
27193   1027194  NaN
...         ...  ...
941589  1941590  NaN
941590  1941591  NaN
941592  1941593  NaN
941593  1941594  NaN
941596  1941597  NaN

[180712 rows x 2 columns]

In [44]:
df_posters.duplicated().sum()

np.int64(0)

In [45]:
df_posters.shape

(941597, 2)

## Analisi di df_releases

In [46]:
df_releases.shape

(1332782, 5)

In [47]:
df_releases.dtypes

id          int64
country    object
date       object
type       object
rating     object
dtype: object

In [ ]:
#df_releases['date'] = pd.to_datetime(df_releases['date'], errors='coerce')

In [48]:
df_releases.isna().sum()

id              0
country         0
date            0
type            0
rating     998802
dtype: int64

In [ ]:
#Non credo che sia un errore se i film non hanno un rating(?) o non capisco che tipo di rating serva 
df_releases.loc[df_releases["rating"].isna()]

In [50]:
df_releases.head(100)

         id    country        date                type rating
0   1000001    Andorra  2023-07-21          Theatrical    NaN
1   1000001  Argentina  2023-07-20          Theatrical    ATP
2   1000001  Australia  2023-07-19          Theatrical     PG
3   1000001  Australia  2023-10-01             Digital     PG
4   1000001    Austria  2023-07-20          Theatrical    NaN
..      ...        ...         ...                 ...    ...
95  1000002     Canada  2019-09-06            Premiere    NaN
96  1000002     Canada  2019-10-25  Theatrical limited    NaN
97  1000002     Canada  2019-11-01          Theatrical    NaN
98  1000002     Canada  2020-01-14             Digital    NaN
99  1000002     Canada  2020-01-28            Physical    NaN

[100 rows x 5 columns]

possiamo notare che i valori di rating sono di diverso genere

In [ ]:
df_AllVotes=df_releases[df_releases['rating'].notna()]
df_AllVotes

              id    country        date        type rating
1        1000001  Argentina  2023-07-20  Theatrical    ATP
2        1000001  Australia  2023-07-19  Theatrical     PG
3        1000001  Australia  2023-10-01     Digital     PG
10       1000001     Brazil  2023-07-20  Theatrical     12
11       1000001     Canada  2023-07-21  Theatrical     PG
...          ...        ...         ...         ...    ...
1332600  1940788     Canada  1991-07-31    Physical      G
1332634  1940823    Germany  1987-03-05  Theatrical     16
1332667  1940857      India  1982-07-09  Theatrical      U
1332691  1940881        USA  1978-01-23  Theatrical     NR
1332711  1940901        USA  1970-05-08          TV     NR

[333980 rows x 5 columns]

In [ ]:
#Scegliere un parametro di valutazione.......

In [64]:
df_releases.duplicated().sum()

np.int64(0)

In [ ]:
df_releases.shape